logs/sync/ab_results-sync-20.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /sync
Document Length:        44389 bytes

Concurrency Level:      20
Time taken for tests:   8.710 seconds
Complete requests:      1000
Failed requests:        994
   (Connect: 0, Receive: 0, Length: 994, Exceptions: 0)
Total transferred:      44594994 bytes
HTML transferred:       44389994 bytes
Requests per second:    114.81 [#/sec] (mean)
Time per request:       174.207 [ms] (mean)
Time per request:       8.710 [ms] (mean, across all concurrent requests)
Transfer rate:          4999.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:    49  172  18.6    165     253
Waiting:       48  163  18.1    156     247
Total:         49  172  18.6    165     253

Percentage of the requests served within a certain time (ms)
  50%    165
  66%    174
  75%    186
  80%    191
  90%    198
  95%    202
  98%    216
  99%    226
 100%    253 (longest request)