logs/sync/ab_results-sync-50.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /sync
Document Length:        44389 bytes

Concurrency Level:      50
Time taken for tests:   8.324 seconds
Complete requests:      1000
Failed requests:        987
   (Connect: 0, Receive: 0, Length: 987, Exceptions: 0)
Total transferred:      44594983 bytes
HTML transferred:       44389983 bytes
Requests per second:    120.13 [#/sec] (mean)
Time per request:       416.208 [ms] (mean)
Time per request:       8.324 [ms] (mean, across all concurrent requests)
Transfer rate:          5231.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       5
Processing:    23  405  58.2    399     484
Waiting:       12  396  57.9    391     475
Total:         24  405  58.0    400     484

Percentage of the requests served within a certain time (ms)
  50%    400
  66%    408
  75%    431
  80%    444
  90%    470
  95%    475
  98%    479
  99%    481
 100%    484 (longest request)